In [3]:
import pandas as pd
import numpy as np

## Handling Missing Data

In [4]:
string_data = pd.Series(['afdssa','fdsfas', np.nan, 'avocade'])
string_data

0     afdssa
1     fdsfas
2        NaN
3    avocade
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
#Python None is also treated as NA in object arrays
string_data[0]=None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

#### Table: NA handling methods
| Argument | Description |
| :------- | :---------- |
| dropna | Filter axis labels based on whether values for each label have missing data, with varying thresholds for how much missing data to tolerate. |
| fillna | Fill in missing data with some value or using an interpolation method such as 'ffill' or 'bfill'. |
| isnull | Return boolean values indicating which values are missing/NA. |
| notnull | Negation of isnull. |

### Filtering Out Missing data

In [7]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [8]:
#drops null data and return only non-null data and index values
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

With DF objects, things are bit complex as you may want to drop rows or columns that are all NA or only those containing any NAs. __dropna__ by deafult drops any row containing a missing value

In [9]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

Passing __how='all'__ will only drop rows that are all NA

In [11]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [12]:
#to drop columns use axis=1 and if to drop columns with all NA
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [13]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

Keep only rows containing a certain number of observations. This can be indicated with the __thresh__ argument

In [14]:
df = pd.DataFrame(np.random.randn(7,3))

In [15]:
df.iloc[:4, 1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0 -1.935224       NaN       NaN
1 -0.184695       NaN       NaN
2  0.950582       NaN  1.419111
3 -1.774611       NaN  1.121288
4 -1.059884  0.289545 -0.548206
5 -0.503733 -0.459280  1.564060
6 -1.422207 -0.276097 -0.988295

In [16]:
#keeps the rows that does not have 2 NA column values
df.dropna(thresh=2)

          0         1         2
2  0.950582       NaN  1.419111
3 -1.774611       NaN  1.121288
4 -1.059884  0.289545 -0.548206
5 -0.503733 -0.459280  1.564060
6 -1.422207 -0.276097 -0.988295

### Filling In Missing Data
- __fillna__ method with a constant replaces missing values with that values
- With __fillna__ method we can pass the mean or median of the series

In [17]:
df.fillna(0)

          0         1         2
0 -1.935224  0.000000  0.000000
1 -0.184695  0.000000  0.000000
2  0.950582  0.000000  1.419111
3 -1.774611  0.000000  1.121288
4 -1.059884  0.289545 -0.548206
5 -0.503733 -0.459280  1.564060
6 -1.422207 -0.276097 -0.988295

Calling __fillna__ with a dict, we can use a different fill values for each column

In [18]:
df.fillna({1:0.5, 2:1.4})

          0         1         2
0 -1.935224  0.500000  1.400000
1 -0.184695  0.500000  1.400000
2  0.950582  0.500000  1.419111
3 -1.774611  0.500000  1.121288
4 -1.059884  0.289545 -0.548206
5 -0.503733 -0.459280  1.564060
6 -1.422207 -0.276097 -0.988295

In [19]:
#fillna method returns a new object, but can modify the existing object in-place
df.fillna(0, inplace=True)
df

          0         1         2
0 -1.935224  0.000000  0.000000
1 -0.184695  0.000000  0.000000
2  0.950582  0.000000  1.419111
3 -1.774611  0.000000  1.121288
4 -1.059884  0.289545 -0.548206
5 -0.503733 -0.459280  1.564060
6 -1.422207 -0.276097 -0.988295

Interpolation methods used for reindexing can be used with __fillna__

In [20]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -1.553311  0.343036  0.539468
1  0.054129  0.529432 -0.389052
2 -0.547979       NaN  0.257724
3  1.339153       NaN -0.118261
4  0.939188       NaN       NaN
5  1.162942       NaN       NaN

In [21]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -1.553311  0.343036  0.539468
1  0.054129  0.529432 -0.389052
2 -0.547979  0.529432  0.257724
3  1.339153  0.529432 -0.118261
4  0.939188       NaN -0.118261
5  1.162942       NaN -0.118261

In [22]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

#### Table: __fillna__ function arguments
| Argument | Description |
| :------- | :---------- |
| value | Scalar value or dict-like object to use to fill missing values |
| method | Interpolation; by default 'ffill' if function called with no other arguments |
| axis | Axis to fill on; default axis=0 |
| inplace | Modify the calling object without producing a copy |
| limit | For forward and backward filling, maximum number of consecutive periods to fill |

## Data Transformation

### Removing Duplicated

In [23]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

The DataFrame method __duplicated__ returns a boolean Series indicating whether each __row is a duplicate or not.__

In [24]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

__drop_duplicates__ returns a DF where __duplicated__ array is __false__.
- These two methods by default consider all of the columns
- These two methos by default keep the first observed value combination

In [25]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [26]:
#can specify any subset of them to detect the duplicated
data['v1'] =range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

Passing __keep='last'__ will return the last one

In [27]:
data.drop_duplicates(['k1','k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping
- Perform some transformation based on the values in an array, Series, or column in a DF

In [28]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon',
                    'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [29]:
#add a column indicating the type of animal that each food came from
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

__map__ method on a Series accepts a function or dict_like object containing a mapping

In [30]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [31]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [32]:
#we could have just passed a funtion
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values
- __fillna__ method is a special case of more general value replacement
- __map__ can be used to modify a subset of values in an object
- __replace__ method provides a simpler and more flexible way to do sp
- __data.replace__ method is distinct from __data.str.replace__ which performs string substitution element-wise

In [33]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [34]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [35]:
#replacing multiple values at once, pass a list and then substitute value
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [36]:
#for different replacement for each value, pass a list of substitues
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [37]:
#the replace can also have dict argument
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes
- axis labels can be similarly transformed by a funtion or mapping of some form to produce new, differently labeled object.
- can modify the axes in-place without creating a new data structure

In [38]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

Axis Indexes also have a __map__ method

In [39]:
data.index.map(lambda x: x.upper())

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [40]:
#assign to index, modifying the DF inplace
data.index = data.index.map(lambda x: x.upper())
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

__rename__ method: create a transformed version of a dataset without modifying the original.
This method can be written in conjunction with a dict-like object providing new values for a subset of the axis labels

In [41]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [42]:
data.rename(index={'OHIO':'INDIANA'}, columns={'three':'peeka'})

          one  two  peeka  four
INDIANA     0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [43]:
#does not hace to copy DF manually and asigning to its index and columns attributes
data.rename(index={'OHIO':'INDIANA'}, inplace=True)
data

          one  two  three  four
INDIANA     0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

### Discretization and Binning
Continous data is often discretized or otherwise separated into "bins" for analysis. Suppose you have data about a group of people in a study, and you want to group them into discrete age buckets

In [44]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

To divide data into bins we use __cut__ function in pandas.
- The objects returns is a special __categorical__ object

In [45]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

The output by the __cut__ function describes the bins computed by __pandas.cut__. Internally, it contains a __categories__ array specifying the distinct category names along with labeling for __ages__ data in the __codes__ attribute.

In [46]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [47]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [48]:
pd.value_counts(cats)   #bin counts for the result of pd.cut

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

The output is consistent with mathematical notation for intervals, a parenthesis means that the side is *open*, while the square bracket means it is *closed* (inclusive). Can change which side is closed by passing __right=False__

In [49]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [50]:
#give labels to the bins
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [51]:
data = np.random.rand(20)
#uniformly distributed data is chopped into fourths by computing equal-length bins based on the min and max values in the data
cc = pd.cut(data, 4, precision=2)   #precision option limits the decimal precision to two digits
pd.value_counts(cc)

(0.72, 0.95]      8
(0.25, 0.48]      5
(0.0097, 0.25]    4
(0.48, 0.72]      3
dtype: int64

__qcut__ bins the data based on sample quantile <br>
Depending on the distribution of the data, using __cut__ will not usually result in each bin having the same number of data points but __qcut__ will obtain roughly equal0size bins.

In [52]:
data = np.random.randn(1000)  #normally distributed
cats = pd.qcut(data, 4)  #cut into quartiles
cats

[(-0.756, -0.0624], (-3.654, -0.756], (0.636, 3.366], (-0.756, -0.0624], (-3.654, -0.756], ..., (-3.654, -0.756], (-0.756, -0.0624], (-3.654, -0.756], (-3.654, -0.756], (0.636, 3.366]]
Length: 1000
Categories (4, interval[float64]): [(-3.654, -0.756] < (-0.756, -0.0624] < (-0.0624, 0.636] < (0.636, 3.366]]

In [53]:
pd.value_counts(cats)

(0.636, 3.366]       250
(-0.0624, 0.636]     250
(-0.756, -0.0624]    250
(-3.654, -0.756]     250
dtype: int64

In [54]:
#can pas own quantiles(numbers between 0 and 1, inclusive)
pd.qcut(data, [0,0.1,0.5,0.9,1.])

[(-1.372, -0.0624], (-3.654, -1.372], (-0.0624, 1.29], (-1.372, -0.0624], (-3.654, -1.372], ..., (-3.654, -1.372], (-1.372, -0.0624], (-1.372, -0.0624], (-3.654, -1.372], (-0.0624, 1.29]]
Length: 1000
Categories (4, interval[float64]): [(-3.654, -1.372] < (-1.372, -0.0624] < (-0.0624, 1.29] < (1.29, 3.366]]

### Detecting and Filtering Outliers

In [55]:
data = pd.DataFrame(np.random.randn(1000,4))  #normally distributed

In [56]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.003250     0.010235     0.008097     0.013416
std       0.978944     1.003703     1.003234     1.036273
min      -3.098445    -3.378678    -3.937514    -3.358315
25%      -0.608597    -0.654141    -0.652013    -0.696430
50%      -0.008808     0.015424     0.016900     0.027250
75%       0.658862     0.724684     0.708167     0.692077
max       3.347388     2.804131     2.977878     3.299701

In [57]:
# find values in one of the columns exceeding 3 in absoulte value
col = data[2]
col[np.abs(col) > 3]

32    -3.105036
610   -3.249733
647   -3.937514
Name: 2, dtype: float64

In [58]:
#select all rows having a value exceeding 3 or -3 using any method on a boolean DF
data[(np.abs(data)>3).any(1)]

            0         1         2         3
6   -0.610601 -3.378678 -1.679785 -0.946050
32   0.284937 -0.668226 -3.105036  0.877907
51  -2.113220 -0.775996 -1.741766  3.160201
72  -3.098445  0.147074  0.852700 -0.005401
223 -1.444163 -3.371245  0.226917 -0.908388
335  1.919016  0.120346  0.963851  3.299701
478  0.167598  0.157848  0.256318 -3.006314
519 -0.323281 -0.028466  0.194076 -3.358315
588  3.059744 -0.179596  0.059401  0.502180
610  0.682067 -0.704411 -3.249733 -0.516026
647 -0.251921  0.023707 -3.937514 -0.035562
772  3.347388  1.961156 -0.152746  0.246843
913 -3.051073 -0.858695  1.400863  2.253970

In [59]:
#values can be set based on certain criteria
data[np.abs(data) > 3] = np.sign(data)*3  #code to cap values outside the interval -3 to 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.002993     0.010985     0.009389     0.013321
std       0.977166     1.001308     0.998869     1.033764
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.608597    -0.654141    -0.652013    -0.696430
50%      -0.008808     0.015424     0.016900     0.027250
75%       0.658862     0.724684     0.708167     0.692077
max       3.000000     2.804131     2.977878     3.000000

__np.sign(data)__ produces 1 and -1 values based on whether the values in __data__ are positive or negative

In [60]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0  1.0
1 -1.0  1.0  1.0  1.0
2 -1.0  1.0  1.0 -1.0
3  1.0  1.0 -1.0  1.0
4  1.0 -1.0 -1.0 -1.0

### Permutation and Random Sampling
- Permuting (randomly reordering) a Series or the rows in a DF is easy to do using __numpy.random.permutation__ function.
- Calling __permutation__ with the length of the axis you want to permute produces an array of integers indicating the new ordering

In [61]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [62]:
sampler = np.random.permutation(5)
sampler

array([1, 4, 3, 2, 0])

In [63]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3

__sample__ method on series and DF can be used to select a random subset without replacement

In [64]:
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
4  16  17  18  19

In [65]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

0    5
0    5
3    6
2   -1
4    4
0    5
0    5
0    5
4    4
0    5
dtype: int64

### Computng Indicator/Dummy variables
- Another type of transformation for statistical modeling or ML applications is cinverting a __categorical variable into a "dummy" or "indicator" matrix__.
- Ig a column in a DF has k distinct values, you would derive a matrix or DF with k columns containing all 1s and 0s.
- pandas has a __get_dummies__ function for doing this.

In [66]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1':range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [67]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [68]:
#add a prefix to the columns in the indicator DF
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

## String Manipulation

### String Object Methods

In [69]:
#comma-separated string can be broken into pieces with split
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [70]:
#split is often combined with strip for removing whitespace
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [71]:
#joining strings in a list or tuple
'::'.join(pieces)

'a::b::guido'

In [72]:
#locating substrings
'guido' in val

True

In [73]:
val.index(',')

1

In [74]:
val.find(':')

-1

Difference between __index__ and __find__ method is that __index__ raises exception if the string is not found (versus returning -1)

In [75]:
val.count(',')  #returns the number of occurances of a particular substring

2

In [76]:
val.replace(',',':')  #substitues occurances of one pattern for another

'a:b: guido'

#### Table: Python built-in string methods
| Argument | Description |
| :------- | :---------- |
| count | Return the number of non-overlapping occurrences of substring in the string. |
| endswith | Returns True if string ends with suffix. |
| startswith | Returns True if string starts with prefix. |
| join  |Use string as delimiter for concatenating a sequence of other strings. |
| index | Return position of first character in substring if found in the string; raises ValueError if not found. |
| find | Return position of first character of first occurrence of substring in the string; like index, but returns –1 if not found. |
| rfind | Return position of first character of last occurrence of substring in the string; returns –1 if not found. |
| replace | Replace occurrences of string with another string. |
| strip, rstrip, lstrip | Trim whitespace, including newlines; equivalent to x.strip() (and rstrip, lstrip, respectively) for each element. |
| split | Break string into list of substrings using passed delimiter. |
| lower | Convert alphabet characters to lowercase. |
| upper | Convert alphabet characters to uppercase. |
| casefold | Convert characters to lowercase, and convert any region-specific variable character combinations to a common comparable form. |
| ljust, rjust | Left justify or right justify, respectively; pad opposite side of string with spaces (or some other fill character) to return a string with a minimum width. |

### Regular Expressions
- __Regular Expressions__ provide a flexible way to search or match (often more complex) string patterns in text.
- Python __re__ module is responsibe for applying reqular expressions to strings
- __re__ module functions fall into three categorues: ___pattern matching, substitution, and splitting___.
- A regex describes a pattern to locate in the text

In [77]:
import re
#split a string with a variable number of whitespace characters
text = "foo.     bar\t baz.    \tqux"
re.split('\s+',text)    #regex describing one or more whitespace characters is \s+

['foo.', 'bar', 'baz.', 'qux']

When above line is called, the regualr expression is first *compiled*, and then its __split__ method is called on the passed text. So, we can compile regex ourself with __re.compile__, forming a reusable regex object. This method is highly recommended if we intend to apply the same expression to many strings; doing so will save CPY cycles

In [78]:
regex = re.compile('\s+')
regex.split(text)

['foo.', 'bar', 'baz.', 'qux']

In [79]:
#get a list of all patterns matching the regex
regex.findall(text)

['     ', '\t ', '    \t']

__match__ and __search__ are closely related to __findall__
- __search__ returns only the first match
- __match__ *only* matched at the beginning of the string

In [80]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex = re.compile(pattern, flags=re.IGNORECASE)
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [81]:
m = regex.search(text)
m

In [82]:
text[m.start():m.end()]

'dave@google.com'

In [83]:
print(regex.match(text))

None

In [84]:
#replaces the occurances of the pattern with a new string
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

Segment each address of email address into three components: username, domain name, and domain suffix.<br>
To do this, <u>put parentheses around the parts of the pattern to segment</u>
<br><br>
__match object__ produced by this modified regex returns a tuple of the pattern components with its __group__ method

In [85]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'  #parentheses around the part to segment
regex = re.compile(pattern, flags=re.IGNORECASE)    #form a reusable regex object
m = regex.match('wes@mail.com')
m.groups()    #returns tuple of the pattern components

('wes', 'mail', 'com')

In [86]:
#returns a list of tuples when the pattern has groups
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

__sub method__ has access to groups in each match using special symbols like __\1 and \2__. The sybol __\1__ corresponds to the first matched group, __\2__ corresponds to the second, and so forth.

In [88]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

#### Table: Regular Expression Methods
| Argument | Description |
| :------- | :---------- |
| findall | Return all non-overlapping matching patterns in a string as a list |
| finditer | Like findall, but returns an iterator |
| match | Match pattern at start of string and optionally segment pattern components into groups; if the pattern matches, returns a match object, and otherwise None |
| search | Scan string for match to pattern; returning a match object if so; unlike match, the match can be anywhere in the string as opposed to only at the beginning |
| split | Break string into pieces at each occurrence of pattern |
| sub, subn | Replace all (sub) or first n occurrences (subn) of pattern in string with replacement expression; use symbols \1, \2, ... to refer to match group elements in the replacement string |

### Vectorized String Functions in pandas

In [93]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [94]:
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [96]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [97]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [112]:
matches = data.str.findall(pattern, flags=re.IGNORECASE)

__Vectorized element retrieval__
- __str.get__
- index into the __str__ attribute

In [110]:
matches = data.str.match(pattern,flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [107]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [113]:
matches.str[0]

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [115]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

#### Partial listing of vectorized string methods
| Method | Description |
| :----- | :---------- |
| cat | Concatenate strings element-wise with optional delimiter |
| contains | Return boolean array if each string contains pattern/regex |
| count | Count occurrences of pattern |
| extract | Use a regular expression with groups to extract one or more strings from a Series of strings; the result will be a DataFrame with one column per group |
| endswith | Equivalent to __x.endswith(pattern)__ for each element |
| startswith | Equivalent to __x.startswith(pattern)__ for each element |
| findall | Compute list of all occurrences of pattern/regex for each string |
| get | Index into each element (retrieve i-th element) |
| isalnum | Equivalent to built-in __str.alnum__ |
| isalpha | Equivalent to built-in __str.isalpha__ |
| isdecimal | Equivalent to built-in __str.isdecimal__ |
| isdigit | Equivalent to built-in __str.isdigit__ |
| islower | Equivalent to built-in __str.islower__ |
| isnumeric | Equivalent to built-in __str.isnumeric__ |
| isupper | Equivalent to built-in __str.isupper__ |
| join | Join strings in each element of the Series with passed separator |
| len | Compute length of each string |
| lower, upper | Convert cases; equivalent to __x.lower() or x.upper()__ for each element |
| match | Use __re.match__ with the passed regular expression on each element, returning matched groups as list |
| pad | Add whitespace to left, right, or both sides of strings |
| center | Equivalent to __pad(side='both')__ |
| repeat | Duplicate values (e.g., __s.str.repeat(3) is equivalent to x * 3 for each string)__ |
| replace | Replace occurrences of pattern/regex with some other string |
| slice | Slice each string in the Series |
| split | Split strings on delimiter or regular expression |
| strip | Trim whitespace from both sides, including newlines |
| rstrip | Trim whitespace on right side |
| lstrip | Trim whitespace on left side |